app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
        if @artist.nil?
        flash[:alert] = "Artist not found."
        redirect_to artist_path
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all